{
  "structure": "filesystem",
  "error": null,
  "reference": "master",
  "contentType": "json",
  "source": "gitConnectorAzureQuickStart",
  "paths": [
    "/quickstarts/microsoft.securityinsights/sentinel-automation-rule/prereqs/prereq.azuredeploy.json",
    "/quickstarts/microsoft.securityinsights/sentinel-automation-rule/prereqs/prereq.azuredeploy.parameters.json"
  ],
  "timestamp": 1642962910106,
  "queryuser": null,
  "checksum": "99914b932bd37a50b983c5e7c90ae93b",
  "node": {
    "masterSnapshotId": "ARM_TEMPLATE_SNAPSHOT",
    "type": "arm",
    "collection": "armtemplate",
    "paths": [
      "/quickstarts/microsoft.securityinsights/sentinel-automation-rule/prereqs/prereq.azuredeploy.json",
      "/quickstarts/microsoft.securityinsights/sentinel-automation-rule/prereqs/prereq.azuredeploy.parameters.json"
    ],
    "snapshotId": "ARM_TEMPLATE_SNAPSHOT1659",
    "status": "active",
    "validate": true,
    "resourceTypes": [
      "microsoft.operationalinsights/workspaces",
      "microsoft.operationalinsights/workspaces/providers/alertrules",
      "microsoft.operationalinsights/workspaces/providers/onboardingstates"
    ]
  },
  "snapshotId": "ARM_TEMPLATE_SNAPSHOT1659",
  "collection": "armtemplate",
  "json": {
    "contentVersion": "1.0.0.0",
    "parameters": {
      "workspaceName": {
        "type": "string",
        "metadata": {
          "description": "Name of the Log Analytics workspace"
        },
        "value": "GEN-UNIQUE"
      },
      "ruleName": {
        "type": "string",
        "metadata": {
          "description": "Name of the analytics rule"
        },
        "value": "GEN-UNIQUE"
      },
      "location": {
        "type": "string",
        "defaultValue": "[resourceGroup().location]",
        "metadata": {
          "description": "Location for all resources."
        }
      }
    },
    "variables": {
      "ruleId": "[uniqueString(parameters('ruleName'))]"
    },
    "resources": [
      {
        "apiVersion": "2017-03-15-preview",
        "name": "GEN-UNIQUE",
        "location": "[resourceGroup().location]",
        "tags": {},
        "type": "Microsoft.OperationalInsights/workspaces",
        "properties": {
          "sku": {
            "name": "pergb2018"
          }
        }
      },
      {
        "name": "GEN-UNIQUE/Microsoft.SecurityInsights/default",
        "type": "Microsoft.OperationalInsights/workspaces/providers/onboardingStates",
        "apiVersion": "2021-03-01-preview",
        "dependsOn": [
          "Microsoft.OperationalInsights/workspaces/GEN-UNIQUE"
        ],
        "properties": {}
      },
      {
        "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
        "name": "GEN-UNIQUE/Microsoft.SecurityInsights/[uniqueString(parameters('ruleName'))]",
        "apiVersion": "2021-03-01-preview",
        "kind": "Scheduled",
        "location": "[resourceGroup().location]",
        "dependsOn": [
          "Microsoft.OperationalInsights/workspaces/providers/onboardingStates/GEN-UNIQUE/Microsoft.SecurityInsights/default"
        ],
        "properties": {
          "displayName": "Known IRIDIUM IP",
          "description": "IRIDIUM command and control IP. Identifies a match across various data feeds for IP IOCs related to the IRIDIUM activity group.",
          "severity": "High",
          "enabled": true,
          "query": "let IPList = dynamic([\"154.223.45.38\",\"185.141.207.140\",\"185.234.73.19\",\"216.245.210.106\",\"51.91.48.210\",\"46.255.230.229\"]);\n(union isfuzzy=true\n(CommonSecurityLog\n| where isnotempty(SourceIP) or isnotempty(DestinationIP)\n| where SourceIP in (IPList) or DestinationIP in (IPList) or Message has_any (IPList)\n| extend IPMatch = case(SourceIP in (IPList), \"SourceIP\", DestinationIP in (IPList), \"DestinationIP\", \"Message\") \n| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated) by SourceIP, DestinationIP, DeviceProduct, DeviceAction, Message, Protocol, SourcePort, DestinationPort, DeviceAddress, DeviceName, IPMatch\n| extend timestamp = StartTimeUtc, IPCustomEntity = case(IPMatch == \"SourceIP\", SourceIP, IPMatch == \"DestinationIP\", DestinationIP, \"IP in Message Field\") \n),\n(OfficeActivity\n|extend SourceIPAddress = ClientIP, Account = UserId\n| where  SourceIPAddress in (IPList)\n| extend timestamp = TimeGenerated , IPCustomEntity = SourceIPAddress , AccountCustomEntity = Account\n),\n(DnsEvents \n| extend DestinationIPAddress = IPAddresses,  Host = Computer\n| where  DestinationIPAddress has_any (IPList) \n| extend timestamp = TimeGenerated, IPCustomEntity = DestinationIPAddress, HostCustomEntity = Host\n),\n(imDns \n| extend DestinationIPAddress = DnsResponseName,  Host = Dvc\n| where  DestinationIPAddress has_any (IPList) \n| extend timestamp = TimeGenerated, IPCustomEntity = SrcIpAddr, HostCustomEntity = Host\n),\n(VMConnection \n| where isnotempty(SourceIp) or isnotempty(DestinationIp) \n| where SourceIp in (IPList) or DestinationIp in (IPList) \n| extend IPMatch = case( SourceIp in (IPList), \"SourceIP\", DestinationIp in (IPList), \"DestinationIP\", \"None\") \n| extend timestamp = TimeGenerated , IPCustomEntity = case(IPMatch == \"SourceIP\", SourceIp, IPMatch == \"DestinationIP\", DestinationIp, \"None\"), Host = Computer\n),\n(Event\n| where Source == \"Microsoft-Windows-Sysmon\"\n| where EventID == 3\n| extend EvData = parse_xml(EventData)\n| extend EventDetail = EvData.DataItem.EventData.Data\n| extend SourceIP = EventDetail.[9].[\"#text\"], DestinationIP = EventDetail.[14].[\"#text\"]\n| where SourceIP in (IPList) or DestinationIP in (IPList) \n| extend IPMatch = case( SourceIP in (IPList), \"SourceIP\", DestinationIP in (IPList), \"DestinationIP\", \"None\") \n| extend timestamp = TimeGenerated, AccountCustomEntity = UserName, HostCustomEntity = Computer , IPCustomEntity = case(IPMatch == \"SourceIP\", SourceIP, IPMatch == \"DestinationIP\", DestinationIP, \"None\")\n),\n(SigninLogs\n| where isnotempty(IPAddress)\n| where IPAddress in (IPList)\n| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = IPAddress\n),\n(AADNonInteractiveUserSignInLogs\n| where isnotempty(IPAddress)\n| where IPAddress in (IPList)\n| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = IPAddress\n),\n(W3CIISLog \n| where isnotempty(cIP)\n| where cIP in (IPList)\n| extend timestamp = TimeGenerated, IPCustomEntity = cIP, HostCustomEntity = Computer, AccountCustomEntity = csUserName\n),\n(AzureActivity \n| where isnotempty(CallerIpAddress)\n| where CallerIpAddress in (IPList)\n| extend timestamp = TimeGenerated, IPCustomEntity = CallerIpAddress, AccountCustomEntity = Caller\n),\n(\nAWSCloudTrail\n| where isnotempty(SourceIpAddress)\n| where SourceIpAddress in (IPList)\n| extend timestamp = TimeGenerated, IPCustomEntity = SourceIpAddress, AccountCustomEntity = UserIdentityUserName\n),\n(\nAzureDiagnostics\n| where ResourceType == \"AZUREFIREWALLS\"\n| where Category == \"AzureFirewallApplicationRule\"\n| parse msg_s with Protocol 'request from ' SourceHost ':' SourcePort 'to ' DestinationHost ':' DestinationPort '. Action:' Action\n| where isnotempty(DestinationHost)\n| where DestinationHost has_any (IPList)  \n| extend DestinationIP = DestinationHost \n| extend IPCustomEntity = SourceHost\n),\n(\nAzureDiagnostics\n| where ResourceType == \"AZUREFIREWALLS\"\n| where Category == \"AzureFirewallNetworkRule\"\n| parse msg_s with Protocol 'request from ' SourceHost ':' SourcePort 'to ' DestinationHost ':' DestinationPort '. Action:' Action\n| where isnotempty(DestinationHost)\n| where DestinationHost has_any (IPList)  \n| extend DestinationIP = DestinationHost \n| extend IPCustomEntity = SourceHost\n)\n)",
          "queryFrequency": "P1D",
          "queryPeriod": "P1D",
          "triggerOperator": "GreaterThan",
          "triggerThreshold": 0,
          "suppressionDuration": "PT5H",
          "suppressionEnabled": false,
          "tactics": [
            "CommandAndControl"
          ],
          "alertRuleTemplateName": "7ee72a9e-2e54-459c-bc8a-8c08a6532a63",
          "incidentConfiguration": {
            "createIncident": true,
            "groupingConfiguration": {
              "enabled": false,
              "reopenClosedIncident": false,
              "lookbackDuration": "PT5H",
              "matchingMethod": "AllEntities",
              "groupByEntities": [],
              "groupByAlertDetails": [],
              "groupByCustomDetails": []
            }
          },
          "eventGroupingSettings": {
            "aggregationKind": "SingleAlert"
          },
          "alertDetailsOverride": {
            "alertDisplayNameFormat": "Known IRIDIUM IP: {{IPCustomEntity}}",
            "alertDescriptionFormat": "Alert generated at {{TimeGenerated}}",
            "alertTacticsColumnName": null,
            "alertSeverityColumnName": "Severity"
          },
          "customDetails": {
            "Group": "AADGroupId"
          },
          "entityMappings": [
            {
              "entityType": "Account",
              "fieldMappings": [
                {
                  "identifier": "FullName",
                  "columnName": "AccountCustomEntity"
                }
              ]
            },
            {
              "entityType": "Host",
              "fieldMappings": [
                {
                  "identifier": "FullName",
                  "columnName": "HostCustomEntity"
                }
              ]
            },
            {
              "entityType": "IP",
              "fieldMappings": [
                {
                  "identifier": "Address",
                  "columnName": "IPCustomEntity"
                }
              ]
            }
          ]
        }
      }
    ],
    "outputs": {
      "workspaceName": {
        "type": "string",
        "value": "[parameters('workspaceName')]"
      },
      "ruleId": {
        "type": "string",
        "value": "[variables('ruleId')]"
      }
    },
    "\uff04schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#"
  }
}